# Задание 1
her_age = (int(input("Введите ваш возраст:")))
his_age = (int(input("Введите возраст друга: ")))
math = her_age + his_age
print(math)

# Задание 2
