# Задание 1
#age = int(input())
#if age < 18:
#    print("Вы несовершеннолетний")
#elif age > 18 and age <= 65:
#    print("Вы трудоспособный человек")
#else:
#    print("Вы пенсионер")

# Задание 2
buy = int(input())
if buy < 1000:
    print("Скидка не предоставляется")
elif buy > 1000 and buy <= 5000:
    
    print("Скидка 5%")
else:
    print("Скидка 10%")

# Задание 3
#print("\n[1]Сумма\n[2]")
#summ = int(input("Выберите номер операции"))
#if summ +:
#    print("summ")
