# Задание 1
#age = int(input())
#if age < 18:
#    print("Вы несовершеннолетний")
#elif age > 18 and age <= 65:
#    print("Вы трудоспособный человек")
#else:
#    print("Вы пенсионер")

# Задание 2
buy = int(input())
if buy < 1000:
    print("Скидка не предоставляется")
elif buy > 1000 and buy <= 5000:
    
    print("Скидка 5%")
else:
    print("Скидка 10%")

# Задание 3
#print("\n[1]Сумма\n[2]")
#summ = int(input("Выберите номер операции"))
#if summ:
#    print("summ")

# Задание 6 
#ans = input()
#green_popug = ("B2", "B4", "B6", "B8", "C2", "C7", "C10", "C11")
#blue_popug = ("B1", "B3", "B7", "C1", "C4", "C5", "C6", "C8", "C9")
#if ans in green_popug:
#    print("Зелёный попугай")
#elif ans in blue_popug:
#    print("Синий попугай")
#else:
#   print("Серый попугай")

# Задание 7
ans = int(input())

